colors = ("Синий","Желтый","Красный")
c1 = input("Введите первый цвет: ")
c2 = input("Введите второй цвет: ")
if c1 in colors and c2 in colors:
    if c1 != c2:
        if (c1 in ("Синий","Красный")) and (c2 in ("Синий","Красный")):
            print("Фиолетовый")
        if (c1 in ("Желтый","Красный")) and (c2 in ("Желтый","Красный")):
            print("Оранжевый")
        if (c1 in ("Синий","Желтый")) and (c2 in ("Синий","Желтый")):
            print("Зеленый")
    else:
        print (c1)
else:
    print("Ошибка")